[
    {
        "product_uid": "180158",
        "product_name": "ProCom 80,000 BTU Portable Single Convection Heater",
        "product_description": "ProCom Heating's Portable Convection Outdoor Propane Heaters, also referred to as \"trash can\" heaters in the trade, offer an inexpensive solution for temporary space heating especially for applications where there is no electricity. Compact, lightweight and clean burning, these heaters also feature a 360 heating radius which allows quick and efficient hot air distribution. These commercial grade heaters offer a perfect solution for temporary heating jobs such as garages, construction sites, warehouses, agricultural and industrial applications.California residents: see&nbsp;Proposition 65 information80,000 BTU variable convection heaters3 heat settings - 40,000, 60,000 and 80,000 BTUCirculates convection heat 360 in a degree radiusHeats up to 1,800 sq. ft.No electricity requiredPiezo matchless ignitionCSA  certifiedIncludes 10 ft. hose and regulatorHome Depot Protection Plan:",
        "product_image_url": "https://m.media-amazon.com/images/I/61gMG2vP5ML.jpg",
        "product_image_visual_description": "A portable, cylindrical, metallic heater with a red and black color scheme, featuring a handle on top and dials for temperature control at the front",
        "search_relevance_score": "0.8",
        "reason_for_recommendaion": "Offers versatile heating solutions for various locations and situations, emphasizing mobility and convenience.",
        "related_items": [
            {
                "product_uid": "153802",
                "product_name": "SharkBite 3/4 in. Copper Crimp Rings (100-Pack)",
                "product_description": "The SharkBite barb connection system is the best option for connecting PEX tubing in water distribution systems when lower material cost is desired. Constructed of copper, the SharkBite copper crimp rings are used in conjunction with barb fittings and crimp tools. And with a wide range of fittings, manifolds, regulator, thermostatic, and ball valves available, the SharkBite barb connection system is perfect for your next plumbing project.CopperCrimp tool allows each joint to be checked with go/no-go gaugeUsed in conjunction with PEX tubing and barb fittings, valves, and manifoldsAvailable in 3/8 in., 1/2 in., 3/4 in., & 1 in. sizesTool required has interchangeable jaws that do not require calibration",
                "product_image_url": "https://mobileimages.lowes.com/productimages/29c2b61b-a644-4615-a418-f298bd92a2c4/08753619.jpg?size=pdhism",
                "product_image_visual_description": "A collection of shiny copper rings displayed against a white background, designed for plumbing connections.",
                "search_relevance_score": "0.5",
                "reason_for_recommendaion": "Though not directly related to heating, this product is essential for plumbing projects which may coincide with heating installations."
            },
            {
                "product_uid": "195936",
                "product_name": "Leaktite Premium 5-gal. Food Storage Container (10-Pack)",
                "product_description": "Leaktite's 5 Gal. premium storage containers are manufactured to be safe for food storage. The premium design is manufactured from high quality plastic and is tough enough to store nails and screws along with any standard home or food needs. Includes 10 containers. Lids are available.",
                "product_image_url": "https://www.u-buy.com.ng/product/2E4ENRQQ-leaktite-premium-5-gal-pail-food-storage-container-bucket-strong-reinforced-ribs-sturdy-wire-bail10-",
                "product_image_visual_description": "A group of durable, white 5-gallon plastic buckets stacked together, showcasing their storage capability.",
                "search_relevance_score": "0.4",
                "reason_for_recommendaion": "Useful for storing materials during construction or renovation projects where heating systems are being installed."
            },
            {
                "product_uid": "106723",
                "product_name": "Hampton Bay 3-Light Crawley Oil Rubbed Bronze Vanity Fixture",
                "product_description": "The versatile Crawley vanity fixtures feature a classic timeless architecture that adds an element of distinction to any bathroom. The Oil Rubbed Bronze hand applied finish coordinates with most faucet and hardware manufacturers for easy selection. The fixtures can be mounted in either the up or down position depending on the consumer's choice. The white glass shades provides modern day clean feel with old world design.",
                "product_image_url": "https://images.thdstatic.com/productImages/fe017fa4-6715-4b97-9545-2fbe53c83557/svn/oil-rubbed-bronze-hampton-bay-vanity-lighting-ad065-w3-a0_600.jpg",
                "product_image_visual_description": "An elegant three-lamp vanity light fixture with an oil-rubbed bronze finish and white glass shades.",
                "search_relevance_score": "0.6",
                "reason_for_recommendaion": "Offers lighting solutions that enhance the ambiance of any space being heated."
            },
            {
                "product_uid": "139917",
                "product_name": "Toledo Fine Locks Segovia Antique Brass Keyed Entry Lever Lockset",
                "product_description": "Toledo and Co. offers our customers superior quality locks made by strict specifications to ensure an outstanding security. Toledo Fine Locks is a combination of the latest technology and a traditional craftsmanship with a lifetime warranty. For added security, the entry lock set features an anti-bump key cylinder system. Toledo Fine Locks is perfect for designers and homeowners looking for alternatives that provide distinguished quality, high security, beautiful designs and fine finishes. The Antique Brass Keyed Entry Lever is a perfect blend of timeless design and classic finish. Change your home appearance with this exceptional option.",
                "product_image_url": "https://toledolocks.com/cdn/shop/products/V1900-SE-US3_3e1d4d83-3ec5-4646-b7c9-0b698f575113_800x.png?v=1611925506",
                "product_image_visual_description": "An antique brass door handle set on a white background, showcasing a classic and elegant design.",
                "search_relevance_score": "0.3",
                "reason_for_recommendaion": "While not directly related to heating, securing a property is essential when installing expensive heating systems."
            },
            {
                "product_uid": "192828",
                "product_name": "BDK Warner Brothers Batman Steering Wheel Cover",
                "product_description": "BDK USA Batman steering wheel cover is colorful and durable steering wheel cover that is sure to enhance the appearance of your vehicles interior while allowing you to show off your lighter side. The steering wheel cover features and benefits are cover fits most medium size vehicles, provides comfortable grip on the steering wheel, dresses up the interior of your vehicle, easily slips over most medium size steering wheels and no tools needed.",
                "product_image_url": "https://i5.walmartimages.com/seo/Batman-Car-Steering-Wheel-Cover-Universal-Fit-Officially-Licensed-Warner-Brothers-Graphics-Great-Automotive-Accessory-Gift-Idea-Fans_51119656-6f1e-4efd-9406-940063c8a638.d82d5183cdd1d45f0777c31ae80435c3.jpeg?odnHeight=640&odnWidth=640&odnBg=FFFFFF",
                "product_image_visual_description": "A Batman-themed steering wheel cover showcased in vibrant colors, offering a playful touch to vehicle interiors.",
                "search_relevance_score": "0.2",
                "reason_for_recommendaion": "While not related to home heating or construction, it represents the broad scope of available products catering to various customer interests."
            }
        ]
    }
]